node-js/results.txt
ws-benchmark -c 1000 -n 10000 ws://localhost:8080
ws-benchmark success.
Completed 1000 requests
Completed 2000 requests
Completed 3000 requests
Completed 4000 requests
Completed 5000 requests
Completed 6000 requests
Completed 7000 requests
Completed 8000 requests
Completed 9000 requests
Completed 10000 requests
Concurrency Level:      1000
Time taken for tests:   1.036 seconds
Complete requests:      10000
Failed requests:        0
Requests per second:    9654.89 [#/sec] (mean)
Time per request:       103.575 [ms] (mean)
Time per request:       0.104 [ms] (mean, across all concurrent requests)
Average time:           0.040 [ms]
Min time:               0.014 [ms]
Max time:               2.611 [ms]

Percentage of the requests served within a certain time (ms)
  50%      0.030
  66%      0.038
  75%      0.045
  80%      0.050
  90%      0.066
  95%      0.082
  98%      0.110
  99%      0.148
 100%      2.611


ws-benchmark -c 1000 -n 100000 ws://localhost:8080
ws-benchmark success.
Completed 10000 requests
Completed 20000 requests
Completed 30000 requests
Completed 40000 requests
Completed 50000 requests
Completed 60000 requests
Completed 70000 requests
Completed 80000 requests
Completed 90000 requests
Completed 100000 requests
Concurrency Level:      1000
Time taken for tests:   3.802 seconds
Complete requests:      100000
Failed requests:        0
Requests per second:    26304.31 [#/sec] (mean)
Time per request:       38.017 [ms] (mean)
Time per request:       0.038 [ms] (mean, across all concurrent requests)
Average time:           0.030 [ms]
Min time:               0.012 [ms]
Max time:               7.033 [ms]

Percentage of the requests served within a certain time (ms)
  50%      0.025
  66%      0.031
  75%      0.035
  80%      0.038
  90%      0.047
  95%      0.056
  98%      0.070
  99%      0.083
 100%      7.033


ws-benchmark -c 1000 -n 200000 ws://localhost:8080
ws-benchmark success.
Completed 20000 requests
Completed 40000 requests
Completed 60000 requests
Completed 80000 requests
Completed 100000 requests
Completed 120000 requests
Completed 140000 requests
Completed 160000 requests
Completed 180000 requests
Completed 200000 requests
Concurrency Level:      1000
Time taken for tests:   6.656 seconds
Complete requests:      200000
Failed requests:        0
Requests per second:    30050.19 [#/sec] (mean)
Time per request:       33.278 [ms] (mean)
Time per request:       0.033 [ms] (mean, across all concurrent requests)
Average time:           0.028 [ms]
Min time:               0.012 [ms]
Max time:               4.971 [ms]

Percentage of the requests served within a certain time (ms)
  50%      0.024
  66%      0.029
  75%      0.034
  80%      0.036
  90%      0.043
  95%      0.052
  98%      0.063
  99%      0.074
 100%      4.971


ws-benchmark -c 1000 -n 300000 ws://localhost:8080
ws-benchmark success.
Completed 30000 requests
Completed 60000 requests
Completed 90000 requests
Completed 120000 requests
Completed 150000 requests
Completed 180000 requests
Completed 210000 requests
Completed 240000 requests
Completed 270000 requests
Completed 300000 requests
Concurrency Level:      1000
Time taken for tests:   9.035 seconds
Complete requests:      300000
Failed requests:        0
Requests per second:    33205.33 [#/sec] (mean)
Time per request:       30.116 [ms] (mean)
Time per request:       0.030 [ms] (mean, across all concurrent requests)
Average time:           0.026 [ms]
Min time:               0.012 [ms]
Max time:               10.333 [ms]

Percentage of the requests served within a certain time (ms)
  50%      0.023
  66%      0.027
  75%      0.031
  80%      0.033
  90%      0.040
  95%      0.047
  98%      0.057
  99%      0.068
 100%      10.333


ws-benchmark -c 1000 -n 400000 ws://localhost:8080
ws-benchmark success.
Completed 40000 requests
Completed 80000 requests
Completed 120000 requests
Completed 160000 requests
Completed 200000 requests
Completed 240000 requests
Completed 280000 requests
Completed 320000 requests
Completed 360000 requests
Completed 400000 requests
Concurrency Level:      1000
Time taken for tests:   11.972 seconds
Complete requests:      400000
Failed requests:        0
Requests per second:    33412.52 [#/sec] (mean)
Time per request:       29.929 [ms] (mean)
Time per request:       0.030 [ms] (mean, across all concurrent requests)
Average time:           0.027 [ms]
Min time:               0.012 [ms]
Max time:               5.573 [ms]

Percentage of the requests served within a certain time (ms)
  50%      0.023
  66%      0.027
  75%      0.031
  80%      0.034
  90%      0.040
  95%      0.047
  98%      0.058
  99%      0.067
 100%      5.573

ws-benchmark -c 1000 -n 500000 ws://localhost:8080
ws-benchmark success.
Completed 50000 requests
Completed 100000 requests
Completed 150000 requests
Completed 200000 requests
Completed 250000 requests
Completed 300000 requests
Completed 350000 requests
Completed 400000 requests
Completed 450000 requests
Completed 500000 requests
Concurrency Level:      1000
Time taken for tests:   14.460 seconds
Complete requests:      500000
Failed requests:        0
Requests per second:    34579.22 [#/sec] (mean)
Time per request:       28.919 [ms] (mean)
Time per request:       0.029 [ms] (mean, across all concurrent requests)
Average time:           0.026 [ms]
Min time:               0.012 [ms]
Max time:               5.812 [ms]

Percentage of the requests served within a certain time (ms)
  50%      0.023
  66%      0.027
  75%      0.031
  80%      0.033
  90%      0.039
  95%      0.045
  98%      0.055
  99%      0.064
 100%      5.812